eisup_2019_docmng_integration/src/Documents/абс_РаспределяемыеДоходыРасходыСводнаяВедомость/абс_РаспределяемыеДоходыРасходыСводнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РаспределяемыеДоходыРасходыСводнаяВедомость</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыРаспределенияДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииРаспределния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыРаспределения</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСуммаКРаспределению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИзменениеСтатусовРаспреденияДоходовРасходов/абс_ИзменениеСтатусовРаспреденияДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИзменениеСтатусовРаспреденияДоходовРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходыСводнаяВедомость</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.абс_СтатусыРаспределенияДоходовРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыРаспределенияДоходовРасходов/абс_СтатусыРаспределенияДоходовРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыРаспределенияДоходовРасходов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ПереводВФилиал</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ПереводВКЦ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_РаспределяемыеДоходыРасходы/абс_РаспределяемыеДоходыРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РаспределяемыеДоходыРасходы</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыРаспределенияДоходовРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижений</name>
    <type>
      <types>DocumentRef.ОперацияБух</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииРаспределния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальникОтделаСводнойОтчетности</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКРаспределению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантЗаполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДляПечати</name>
    <type>
      <types>CatalogRef.абс_НомераДляПечати</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доходы</name>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммарныйКоэффициентРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСуммаКРаспределению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Филиал</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУУ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммарныйКоэффициентРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяСуммаКРаспределению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.абс_ВидыДеятельностиКТТК</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеПриемник</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СформированныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.абс_АВИЗО</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Documents/абс_РаспределяемыеДоходыРасходыСводнаяВедомость/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Статус 			= Перечисления.абс_СтатусыРаспределенияДоходовРасходов.СогласованиеДЭФ;
	Ответственный 	= глЗначениеПеременной("глТекущийПользователь");
	Организация		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Ответственный, "ОсновнаяОрганизация");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Статус 			= Перечисления.абс_СтатусыРаспределенияДоходовРасходов.СогласованиеДЭФ;
	Ответственный 	= глЗначениеПеременной("глТекущийПользователь");
	Организация		= УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Ответственный, "ОсновнаяОрганизация");
    ДокументыРаспределения.Очистить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПроверитьПовторныйВводОперации(Отказ);	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	СтатусПоРегистру = абс_БизнесПроцессы.ПолучитьСтатусРаспреденияДоходовРасходов(Ссылка);
	
	Если НЕ Статус = СтатусПоРегистру Тогда
		РегистрыСведений.абс_ИзменениеСтатусовРаспреденияДоходовРасходов.ЗаписатьНовыйСтатус(Ссылка, Статус, ПричинаИзмененияСтатуса);
		Документы.абс_РаспределяемыеДоходыРасходыСводнаяВедомость.ПеревестиСтатусДокументов(ПолучитьМассивДокументов(), Статус, Отказ);
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьТаблицуДокументов() Экспорт
	
	ДокументыРаспределения.Очистить();
	
	Запрос = Новый Запрос;
	Если ВидОперацииРаспределния = 0 Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		|	абс_РаспределяемыеДоходыРасходыДоходы.Ссылка КАК Документ,
		|	абс_РаспределяемыеДоходыРасходыДоходы.НомерСтроки,
		|	абс_РаспределяемыеДоходыРасходыДоходы.Филиал,
		|	абс_РаспределяемыеДоходыРасходыДоходы.КодБУ,
		|	абс_РаспределяемыеДоходыРасходыДоходы.КодУУ,
		|	абс_РаспределяемыеДоходыРасходыДоходы.СуммарныйКоэффициентРаспределения,
		|	абс_РаспределяемыеДоходыРасходыДоходы.ОбщаяСуммаКРаспределению,
		|	абс_РаспределяемыеДоходыРасходыДоходы.СчетДт,
		|	абс_РаспределяемыеДоходыРасходыДоходы.СчетКт,
		|	абс_РаспределяемыеДоходыРасходыДоходы.НоменклатурнаяГруппа,
		|	абс_РаспределяемыеДоходыРасходыДоходы.СтатьяЗатрат,
		|	абс_РаспределяемыеДоходыРасходыДоходы.СтавкаНДС,
		|	абс_РаспределяемыеДоходыРасходыДоходы.СтатьяБюджета,
		|	абс_РаспределяемыеДоходыРасходыДоходы.Ссылка.ЦФУ,
		|	абс_РаспределяемыеДоходыРасходыДоходы.Ссылка.ЦФО
		|ИЗ
		|	Документ.абс_РаспределяемыеДоходыРасходы.Доходы КАК абс_РаспределяемыеДоходыРасходыДоходы
		|ГДЕ
		|	абс_РаспределяемыеДоходыРасходыДоходы.Ссылка.Статус = &Статус
		|	И абс_РаспределяемыеДоходыРасходыДоходы.Ссылка.Дата >= &ДатаНачала
		|	И абс_РаспределяемыеДоходыРасходыДоходы.Ссылка.Дата <= &ДатаКонца";
	ИначеЕсли ВидОперацииРаспределния = 1 Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		|	абс_РаспределяемыеДоходыРасходыРасходы.Ссылка КАК Документ,
		|	абс_РаспределяемыеДоходыРасходыРасходы.НомерСтроки,
		|	абс_РаспределяемыеДоходыРасходыРасходы.Филиал,
		|	абс_РаспределяемыеДоходыРасходыРасходы.КодБУ,
		|	абс_РаспределяемыеДоходыРасходыРасходы.КодУУ,
		|	абс_РаспределяемыеДоходыРасходыРасходы.СуммарныйКоэффициентРаспределения,
		|	абс_РаспределяемыеДоходыРасходыРасходы.ОбщаяСуммаКРаспределению,
		|	абс_РаспределяемыеДоходыРасходыРасходы.СчетДт,
		|	абс_РаспределяемыеДоходыРасходыРасходы.СчетКт,
		|	абс_РаспределяемыеДоходыРасходыРасходы.НоменклатурнаяГруппа,
		|	абс_РаспределяемыеДоходыРасходыРасходы.СтатьяЗатрат,
		|	абс_РаспределяемыеДоходыРасходыРасходы.СтавкаНДС,
		|	абс_РаспределяемыеДоходыРасходыРасходы.Подразделение,
		|	абс_РаспределяемыеДоходыРасходыРасходы.СтатьяБюджета,
		|	абс_РаспределяемыеДоходыРасходыРасходы.ВидДеятельности,
		|	абс_РаспределяемыеДоходыРасходыРасходы.ПодразделениеСтр,
		|	абс_РаспределяемыеДоходыРасходыРасходы.ПодразделениеПриемник,
		|	абс_РаспределяемыеДоходыРасходыРасходы.Ссылка.ЦФУ,
		|	абс_РаспределяемыеДоходыРасходыРасходы.Ссылка.ЦФО
		|ИЗ
		|	Документ.абс_РаспределяемыеДоходыРасходы.Расходы КАК абс_РаспределяемыеДоходыРасходыРасходы
		|ГДЕ
		|	абс_РаспределяемыеДоходыРасходыРасходы.Ссылка.Статус = &Статус
		|	И абс_РаспределяемыеДоходыРасходыРасходы.Ссылка.Дата >= &ДатаНачала
		|	И абс_РаспределяемыеДоходыРасходыРасходы.Ссылка.Дата <= &ДатаКонца";		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Статус", Перечисления.абс_СтатусыРаспределенияДоходовРасходов.СогласованиеДЭФ);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаКонца", 	КонецМесяца(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 		
		строкаДокументов = ДокументыРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(строкаДокументов, Выборка);		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПроверитьПовторныйВводОперации(Отказ)
		
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	Док.Ссылка
	                      |ИЗ
	                      |	Документ.абс_РаспределяемыеДоходыРасходыСводнаяВедомость КАК Док
	                      |ГДЕ
	                      |	Док.Организация = &Организация
	                      |	И Док.ВидОперацииРаспределния = &ВидОперацииРаспределния
	                      |	И Док.Ссылка <> &Ссылка
	                      |	И КОНЕЦПЕРИОДА(Док.Дата, МЕСЯЦ) = &Период");
						  
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ВидОперацииРаспределния", ВидОперацииРаспределния);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Для %1 по виду операции %2 за период %4, уже введен документ: %3", 
																				Организация, 
																				?(ВидОперацииРаспределния = 0, "Доходы", "Расходы"),
																				Выборка.Ссылка,
																				Формат(Дата, "ДФ='ММММ гггг'"));
		ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
	КонецЕсли;
	

КонецПроцедуры

Функция ПолучитьМассивДокументов()
	
	МассивИсточник = Новый Массив;
	МассивПриемник = Новый Массив;
	
	Для Каждого строка из ДокументыРаспределения Цикл 
		МассивИсточник.Добавить(строка.Документ);	
	КонецЦикла;
	
	Для Каждого Элемент Из МассивИсточник Цикл	
		Если МассивПриемник.Найти(Элемент) = Неопределено Тогда	
			МассивПриемник.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПриемник;
	
КонецФункции
